[
  {
    "id": 1,
    "title": "سياسة التنفيذ الذي يلتقط اتجاه OSS",
    "description": "■ نظرة عامة سنوات ن الأخيرة، في تطوير التطبيق الروبوت، لمعرفة ما إذا كان هناك فإن أي مكتبة لا يكون من قبيل المبالغة أن نقول إن إلزامية.\n ومع ذلك، في محاولة لتلمس الثقافة تطوير أول برنامج الروبوت، إلى أي نوع من الأشياء مثل صناعة يعرف كل الناس ما إذا كان ن أصبح المعيار هو الالتفات إلى ما سوف تحتاجه هو قليل الخبرة. ل مركز ن منها نموذجية، إذا كنت وجعل شخصيا من الآن اعتقد انه اذا Ikere الحديث عن انها مثل أو تحاول أن تبدو وكأنها.\n\n ■ موضوع ن الروبوت المبتدئين إلى وسيط ن ن ■ يجب أن تعرف ن الحد الأدنى للحديث، وصفا موجزا لمزايا وعيوب كل مكتبة.\n أيضا، أخيرا، لهذا إذا بنفسك! أريد أيضا أن أتحدث كملخص من مثل هذه.\n - تطوير بيئة ن - اللغة (Java8، Kotlin) مكتبة من أجل تحقيق شيء قريب من ن Java8 (خفيفة الوزن ستريم-API، Retrolambda، ThreeTenABP) ن - مكتبة دعم (AppCompat، تصميم، شروح، RecyclerView ... الخ) ن - ربط البيانات ن - شبكة (الوابل، التحديثية OkHttp ... الخ) ن - التسلسل (GSON، ProtoBuf) ن - صورة لودر (بيكاسو، الإنزلاق، فريسكو ... الخ) ن - تأثير (GPUImage ... الخ) ن - DI (ButterKnife، خنجر، RoboGuice) ن - FRP (RxJava، RxAndroid، RxLifecycle ... الخ) ن - DB / مكتب إدارة السجلات (عالم، ActiveAndroid، RxPreferences، Sqlbrite. الخ) ن - حانة / الفرعية (أوتو، EventBus ... الخ) ن - واجهة المستخدم (ObservableScrollview، الخط ... الخ) ن - التصحيح (Crashlytics، خشب، هوغو، Steho، LeakCanary، Takt .. الخ)",
    "speaker": {
      "id": 1,
      "name": "wasabeef",
      "image_url": "https://pbs.twimg.com/profile_images/427481863343452160/i-G-x-Gw.jpeg",
      "twitter_name": "wasabeef_jp",
      "github_name": "wasabeef"
    },
    "stime": "2016-02-18 10:00:00",
    "etime": "2016-02-18 11:00:00",
    "category": {
      "id": 1,
      "name": "محاضرة رئيسية"
    },
    "place": {
      "id": 1,
      "name": "المكان الرئيسي"
    },
    "language_id": "ja",
    "slide_url": ""
  },
  {
    "id": 2,
    "title": "Rxjava نمط متكرر التي يمكن استخدامها اعتبارا من يوم غد",
    "description": "cookpad هي واحدة من عدد قليل من الشركات في اليابان التي أدخلت على RxJava.\n في هذه الدورة، وأعتقد أن من شفرة المصدر من العدد الفعلي للداخلية التطبيق Rxjava إعطاء دراسة المكان الذي يتم استخدامه، في محاولة لإدخال بعض أنماط ن تصميم المتكرر.\n بواسطة إدخال المشهد الاستخدام الفعلي، وأنا أتمنى أن تكون قادرا على توضيح صورة مقدمة RxJava.\n ن موضوع: ن * RxJava مبتدئين ن * RxJava قليلا في حيرة من قبل هذا الشخص ن ن التحدث المحتوى (المخطط) أريد أن أعرض على أعمال ن ن * مقدمة الذاتي (2min) ن * لRxjava (5min) ن * Rxjava، ن * المعارف الأساسية لفهم الحالي الشرائح ن * ملحوظة لRxandroid، المشترك، الموضوع، 4 واحد من مقدمة لإدخال ن نمط * متكررة، مثل الاشتراك (15min) [ربما نمط لإدخال تعديلات] ن * استخدام لعينة web_api وصف ن * غير المتزامن - معالجة التسلسلي (flatMap) ن * غير المتزامن - كان نمط استخدام المعالجة المتوازية (combineLatist) ن * combineLatist وتخضع ن * وغير المتزامن معقد قليلا - معالجة التسلسلي (زوج، الصفوف (tuple)، يمكن ملاحظتها # فقط) ن * النقطة التي تريد أن تكون حذرا (5min) ن * أين يضع هل تصحيح هذه الظاهره .. ن * trello / rxLifecycle وAndroidSuvscription ن * في نهاية الامر هو ما ن * وحدة اختبار لاستخدام",
    "speaker": {
      "id": 2,
      "name": "kazy",
      "image_url": "https://pbs.twimg.com/profile_images/431287539366776832/UqbQidjX.jpeg",
      "twitter_name": "101kaz",
      "github_name": "kazy1991"
    },
    "stime": "2016-02-18 11:30:00",
    "etime": "2016-02-18 12:00:00",
    "category": {
      "id": 2,
      "name": "آخر"
    },
    "place": {
      "id": 2,
      "name": "القاعة A"
    },
    "language_id": "ja",
    "slide_url": ""
  },
  {
    "id": 3,
    "title": "ماجستير في قماش",
    "description": "الموضوع:\nCanvas ترغب في الرسوم المتحركة مع تطوير المتوسطة ن ن لمحة عامة: وصف تنفيذ كيفية تنفيذ الرسوم المتحركة الغنية باستخدام مسار في\nCanvas، أيضا تصميم بسيط باستخدام المصور في قماش وسوف نتحدث عن كيفية ن\nPath الرسوم المتحركة التخصيص من Interpolatior مع، وكيفية جعل الصيغة، فإننا سوف يشرح في مزيد من التفاصيل، مثل طريقة مخصصة لTypeEvaluator. أساليب مفيدة مثل مسار # المرجع من في nPath API19 أضاف أيضا Runado أن يكون، وانتشر عرض التمثيل.\nMaterial وقصة رائعة من عرض صغيرة في المناظرة السابقة. ن سهلة لجعل تنفيذ التغييرات الرسوم المتحركة في التصميم المصنوع من nIllustrator وفي ذلك الوقت . ثم وصف البرنامج النصي الذي كنت تملك لاستخدامها ن ن أساسا وسوف نبذل بينما يصف مشاهدة التالي\nTextMorphingView :. https://twitter.com/amyu_san/status/654555982958166016\nWaveSwipeRefreshLayout: https://github.com/recruit-lifestyle/WaveSwipeRefreshLayout\nBeerSwipeRefreshLayout: https://github.com/recruit-lifestyle/BeerSwipeRefresh\nColoringLoading: https://github.com/recruit-lifestyle/ColoringLoading",
    "speaker": {
      "id": 3,
      "name": "Yuki Mima (@amyu_san)",
      "image_url": "https://pbs.twimg.com/profile_images/378800000194224027/5d5d92036fba329fbfc83f06bb2f464f.jpeg",
      "twitter_name": "amyu_san",
      "github_name": "amyu"
    },
    "stime": "2016-02-18 11:30:00",
    "etime": "2016-02-18 12:00:00",
    "category": {
      "id": 3,
      "name": "واجهة المستخدم · التصميم"
    },
    "place": {
      "id": 3,
      "name": "غرفة B"
    },
    "language_id": "ja",
    "slide_url": ""
  },
  {
    "id": 4,
    "title": "نصائح تنمية وآخر تطورات الوضع في التلفزيون لنظام التشغيل Android",
    "description": "[ملخص] ن 2015 سنة لبدء التلفزيون الخدمة النار والروبوت التلفزيون في اليابان، لدينا عدد متزايد من السيناريوهات التي لاستخدام التطبيق على جهاز التلفزيون. ونحن نقدم مثل لديها بالفعل وسائل، وينبغي أن مهام تطوير تطبيقات التلفزيون.\n ن محتويات التالية:\nAndroid من سوق التلفزيون مقدمة ن ن مثل آخر تطورات الوضع من الميزات المثيرة للاهتمام ودية\nTV إجراءات النامية لبدء\nTV ل[موضوع] ن الروبوت تطوير مبتدئ - هناك تجربة التنمية الوسيطة ن التطبيق، إذا كنت أكثر اهتماما في سوق NTV، التي تعتبر امتدادا للتلفزيون ل",
    "speaker": {
      "id": 4,
      "name": "Takeshi Kobayashi",
      "image_url": "",
      "twitter_name": "",
      "github_name": ""
    },
    "stime": "2016-02-18 11:30:00",
    "etime": "2016-02-18 12:00:00",
    "category": {
      "id": 4,
      "name": "خردوات"
    },
    "place": {
      "id": 4,
      "name": "غرفة C"
    },
    "language_id": "ja",
    "slide_url": ""
  },
  {
    "id": 5,
    "title": "تقنيات متقدمة RecyclerView",
    "description": "معظم الناس يستخدمون الآن الروبوت RecyclerViews في التطبيقات في هذه الأيام، ولكن عدد قليل نسبيا من استخدامها لكامل إمكاناتها. في ديكور البند ومكونات ItemAnimator من RecyclerView تسمح لمزيد من المرونة لمحتوى قائمتنا كان بعد ذلك كل ما يمكن مع ListView. بينما لديهم واجهات برمجة التطبيقات بسيطة نسبيا، وفتح كامل إمكاناتهم يمكن أن يستغرق بعض الوقت والممارسة. نين هذا الكلام ونحن سوف تغطي استخدامات متقدمة من ديكور البند لجعل التراكيب قائمة فريدة من نوعها حقا. سنقوم أيضا تغطية ItemAnimators لعرض كيفية جعل المحتوى الخاص بك تبدو كبيرة ويشعر وكأنه مصقول المواد تطبيق صمم.",
    "speaker": {
      "id": 5,
      "name": "Joshua Jamison",
      "image_url": "",
      "twitter_name": "",
      "github_name": ""
    },
    "stime": "2016-02-18 11:30:00",
    "etime": "2016-02-18 12:00:00",
    "category": {
      "id": 3,
      "name": "واجهة المستخدم · التصميم"
    },
    "place": {
      "id": 5,
      "name": "غرفة D"
    },
    "language_id": "en",
    "slide_url": ""
  },
  {
    "id": 6,
    "title": "أسرع الروبوت",
    "description": "وملخص] تطبيق nAndroid إدخال السيئة الدراية لتسريع (شيء جيد إذا كنت لا تعرف). كود NJava، رمز بايت في Dalvik، لغة الآلة، التي تأتي وتذهب بين الجهاز الظاهري، أو قد يكون Rure أن كيفية تطوير 'في كود جافا'، وأسرع من التطبيق؟ أنت تتحدث.\n ※ لا يتحدث من JNI ن ن يكون المطورين [موضوع]\nAndroid الفخار تعبت من تطوير ن ن [ما هو الجديد؟ ]\n المقام الأول، ولكن أنا تقريبا لا يمكن حتى الحديث عن رمز بايت في Dalvik يذكر،\n حيث لا تناسب هذا الوقت، كنت صريح وبالضبط شرح أعمق جزء من ART!\n ن [تفاصيل نظرة عامة]\n1) آلية\n2) مترجم من ART، أو مترجم JIT، عثمان المترجم\n- كل من بيئة تنفيذ يستخدم وفي ما الحالات؟\n3) لمحة عامة عن رمز في Dalvik بايت رمز بايت N-، أو تعليمات سريع، تعليمات بطيئة يتم إنشاء N- تعليمات بطيئة في ما الرمز؟\n4) قاعدة يا غير مرئية من على كود N- من\n- كود عثمان من\n- رمز بايت في Dalvik من الغوص\n- جافا رمز بايت إلى الجهاز الظاهري إلى رمز بايت في Dalvik إلى رمز عثمان إلى جهاز ظاهري Heddo\n5) تسريع جمع الدراية\n- هذا الرمز تحديد موقع لا يوجد أي معنى!\n- في الواقع هو سريع هذا الرمز!",
    "speaker": {
      "id": 6,
      "name": "kmt-t",
      "image_url": "https://pbs.twimg.com/profile_images/491133020833710080/QkK7ryK_.png",
      "twitter_name": "kmt_t",
      "github_name": ""
    },
    "stime": "2016-02-18 13:00:00",
    "etime": "2016-02-18 13:50:00",
    "category": {
      "id": 5,
      "name": "منصة"
    },
    "place": {
      "id": 2,
      "name": "القاعة A"
    },
    "language_id": "ja",
    "slide_url": ""
  },
  {
    "id": 7,
    "title": "تعلم صحة الروبوت لينت",
    "description": "أداة تحليل ثابت · الروبوت لينت وتميل عمياء لتعتقد أن الشرير إلى فشل بناء، ولكن في الحقيقة هي كنز من أفضل الممارسات وفرت لنا مع مجموعات.\n في هذه الدورة، مع مختارة بعناية أكثر من 200 دولة ضخمة مع الروبوت لينت، وسوف نقدم في وسط الأشياء مبتدئين تميل إلى الانخفاض.\n ن لماذا لا استطيع فعل ذلك. كيف يمكننا إصلاحه. إصلاح وما هو سعيد. بقلم تعلم أفضل الممارسات أثناء التحقق ن معا، ويمكنك البدء في تسلق الدرج إلى المتوسطة من المبتدئين.\n\n ■ موضوع ن * ما زلنا لا نعرف أفضل الممارسات من الروبوت البرمجة للمبتدئين ن * المؤشرات تريد نوعية الموظفين تمثل نوعية تطبيقات الروبوت ن ن ■ التحدث محتوى ن ن * مبتدئين الأخطاء الشائعة الرمح ن - الرأي القائل بأن مرتبة في LinearLayout لا تظهر لماذا؟\n - لا ننسى استدعاء FragmentTransaction من ارتكاب ()؟\n - لا ننسى استدعاء SharedPreference من ارتكاب ()؟\n - لا تنسوا دعوة المعرض () من نخب؟\n - لا ننسى استدعاء الذاكرة الأكل مثل الزملاء من المهملات ()؟\n - زر موافق يقول وضعها على يسار يرجع إلى المدرسة الابتدائية؟\n - ··· وقد كتب مباشرة للمستخدم رؤية النص على التخطيط؟\n * ن وبالنسبة لأولئك الذين يهدفون على أكثر - لContentProvider، يتعرض تماما لعرض؟\n - هل سبق لك أن تحدد inputType وتلمح إلى EDITTEXT؟\n - رمز من اللون والحجم، لذلك أقول لكم؟\n - نفس الرمز ليست مضيعة ولكن هناك عدة في الاسم المستعار؟\n - زعيم ثلاث نقاط (...)، لكنها ليست الكتابة بأي حال من الأحوال في الفترة؟\n\n (محتويات قابلة للتغيير)",
    "speaker": {
      "id": 7,
      "name": "Yukiya Nakagawa (@Nkzn)",
      "image_url": "https://pbs.twimg.com/profile_images/628405519447764992/kGVNBAVU.png",
      "twitter_name": "Nkzn",
      "github_name": "Nkzn"
    },
    "stime": "2016-02-18 13:00:00",
    "etime": "2016-02-18 13:50:00",
    "category": {
      "id": 6,
      "name": "البيئة وأدوات التطوير"
    },
    "place": {
      "id": 3,
      "name": "غرفة B"
    },
    "language_id": "ja",
    "slide_url": ""
  },
  {
    "id": 8,
    "title": "التطبيق الروبوت التي وضعتها العودة موبايل",
    "description": "[الهدف]\nAndroid المتوسطة ~المنظمات غير الحكومية مبتدئين ~نن [نظرة عامة]المنظمات غير الحكومية موبايل، ومكتبة لصنع الروبوت ودائرة الرقابة الداخلية التطبيقات الذهاب إلى فريق العودة جوجل تتقدم تنفيذ كمشروع الفرعية - مجموعة من الأدوات.\nالمنظمات غير الحكومية التطبيق مكتوب في موبايل هي واحدة من عدد قليل، ولكن لإطلاق تطبيق يسمى فريق العودة هو في الواقع اللبلاب.\n ملاحظة: الشبكي:؟ //play.google.com/store/apps/details معرف = org.golang.ivyنن أيضا، والمتكلمون أيضا وأطلق سراح تجربة فعلا كتب التطبيق بسيطة مع العودة موبايل هناك.\n ملاحظة: الشبكي:؟ //play.google.com/store/apps/details هل معرف = net.hinoichi.gofunنن لا يزال في مرحلة تجريبية التكنولوجيا، وإنما هو تكنولوجيا ممتعة جدا في المستقبل.المنظمات غير الحكومية في موبايل، لأن ثروة من صفقة قياسية من العودة هو استخدام قليلا، ويمكنك بسهولة إرسال مجموعة واسعة جدا من المعالجة، مثل النص المتشعب الخادم ومعالجة الصور.\n وبالإضافة إلى ذلك، يمكنك أيضا استخدام عدد من المكتبات طرف ثالث مكتوب في العودة. على سبيل المثال، إذا كنت تستخدم goproxy، يمكنك الوقوف على التطبيق الروبوت بسهولة الملقم الوكيل.\nن ولكن المعلومات من اليابانيين لا يزال صغيرا، المنصة إذهب موبايل شفرة المصدر والتوثيق، ويلخص تم فحص محتويات من مثل مواد العرض للمؤتمر من الخارج، ما يمكنك القيام به، حول كيفية تنفيذ فعل العودة تصفه بأنه يمكن أن ينظر إليه حتى بالنسبة للمبتدئين.\nن على سبيل المثال، وهناك نوعان من تطوير الأساليب التالية في العودة موبايل، ولكن كل من الملخص والوصف، هناك ما هو نوع من ميزة على التوالي ومن المتوقع أن نتحدث عن كيفية استخدامها،.\n\n ■ تطبيقات الوطنيةن ذلك كله هو وسيلة لإرسال في العودة. أن يكتب فينوي أيضا عن العودة، وهي مناسبة لتطوير مثل هذه المباريات.\n ملاحظة: الشبكي: هو //github.com/golang/go/wiki/Mobile#native-applicationsنن ■ كيفية استدعاء SDK، الذي كتب من التطبيق\nJava SDK في العودة من خلال JNI.هو مكتوب الجزء من خلال الاستفادة من نقاط القوة في المنظمات غير الحكومية في العودة، الجزء الذي يدعو يفترض أن الروبوت من واجهة برمجة التطبيقات لتكون مكتوبة بلغة جافا.\n ملاحظة: الشبكي: //github.com/golang/go/wiki/Mobile#sdk-applications-and-generating-bindingsنن وبالإضافة إلى ذلك، العودة لأنه هو عبر تجميع، فإنه يبني على لينكس / ARM ل إذا، يمكنك إنشاء قيادة للتحرك بسهولة على قذيفة بنك التنمية الاسيوى. هذا، وأعتقد أنه إذا كان يمكنك أيضا قدم نصائح باستخدام العودة التي يمكن استخدامها في كل يوم من تطوير التطبيق الروبوت.وتجدر الإشارة إلى \nن و، لأنها ستكون قصة لمطوري أندرويد، لا مشكلة حتى لو كنت لا تعرف الكثير عن العودة.\nن [المرجع]المنظمات غير الحكومية الجوال: الشبكي: //github.com/golang/mobileالمنظمات غير الحكومية إلا أن يجعل التطبيق الروبوت (المتحدثون من هذه المادة): HTTP: //klabgames.tech.blog.jp.klab نقوم بهإدارة مؤتمر المنظمات غير الحكومية [حول] المتكلمون كوم / المحفوظات / 1034818110.htmlنن. يذهب التاريخ حوالي 4-5 سنوات. الأعمالن، والألعاب عبر الإنترنت النقالة (الهواتف الذكية لعبة) هو المسؤول عن تطوير العميل.",
    "speaker": {
      "id": 8,
      "name": "tenntenn",
      "image_url": "https://pbs.twimg.com/profile_images/592343163492126720/RlOMqlbS.png",
      "twitter_name": "tenntenn",
      "github_name": "tenntenn"
    },
    "stime": "2016-02-18 13:00:00",
    "etime": "2016-02-18 13:50:00",
    "category": {
      "id": 6,
      "name": "البيئة وأدوات التطوير"
    },
    "place": {
      "id": 4,
      "name": "غرفة C"
    },
    "language_id": "ja",
    "slide_url": ""
  },
  {
    "id": 9,
    "title": "شظايا لماذا، كيف، وماذا عنه؟",
    "description": "وستغطي هذا الحديث كيفية عمل شظايا في التفاصيل من خلال مقارنة والمقابلة بينها إلى ما نعرفه جيدا، والأنشطة. في ذلك، وسوف تشمل أيضا أمثلة وحالات الاستخدام. شظايا: لماذا، كيف، وماذا عنه؟ ويستهدف نحو المطورين الذين قد لا يكون لديه الكثير من الخبرة باستخدام شظايا، وأولئك الذين يريدون أن يفهموا بشكل أفضل. ولماذا؟ - لماذا جوجل إدخال شظايا؟ ليست الأنشطة بما فيه الكفاية؟ فندق nhow؟ - كيف شظايا العمل؟\n ما ل؟ - مثال وحالات الاستخدام تسليط الضوء على إعادة استخدام جزء، جزء واحد مقابل متعددة الجبهات، ViewPager، درج التنقل وDialogFragment.",
    "speaker": {
      "id": 9,
      "name": "Brenda Cook",
      "image_url": "https://pbs.twimg.com/profile_images/607908510303526914/0ewn2oqj.jpg",
      "twitter_name": "kenodoggy",
      "github_name": "kenodoggy"
    },
    "stime": "2016-02-18 13:00:00",
    "etime": "2016-02-18 13:50:00",
    "category": {
      "id": 5,
      "name": "منصة"
    },
    "place": {
      "id": 5,
      "name": "غرفة D"
    },
    "language_id": "en",
    "slide_url": ""
  },
  {
    "id": 10,
    "title": "الخلفية وفعلنا في العملية التي أصبحت اختبار الكتابة الكتابة العم",
    "description": "[نظرة عامة] وفعلت تطوير التطبيق الروبوت في الأعمال التجارية ن ستكون أولوية مطلقة لوقت التسليم، فمن السهل أن اختبار التعليمات البرمجية على الموقد الخلفي. المركز الأول في الترتيب لكتابة رمز اختبار بشكل صحيح ولكن يجب أن تكون في تصميم عالية القابلية للاختبار، وهذا كثير، وأنا أحاول أن أكتب رمز اختبار من بعد تصميم جدا إعطاء الأولوية لتاريخ التسليم يصبح إهمال انها ستسقط في الدولة التي لا أستطيع أن أكتب وكذلك على ما أعتقد. سوف تحدث مرة واحدة أثر كبير في الخريف والتطور اللاحق في مثل هذه الحالة. إذا كان ذلك ممكنا، يصيح صيانة وإذا لم يكن هناك رمز اختبار، في الروح القتالية وظيفة من وظائف التطبيق هو أكثر ازدحاما صيانة أصبح من الصعب. في هذا العرض، بناء على سبيل المثال عبارة في المشروع، والتغيير في كيفية قابلية الاختبار من تصميم عالية من الدولة التي يتم فيها صيانة رمز الاختبار مع عدم وجود الروح القتالية في كل شيء، لإدخال أي إطار اختبار، كيف أود أن أتحدث عن حقيقة أن ما جعل الثقافة لكتابة اختبار في الفريق بأكمله.\n\nAndroid محددة: ن مشروع تطوير التطبيق الروبوت الفعلي في المثال الأصلي بأي شكل من الأشكال أن ما قدم إلى\nExpertise اختبار ن: حالة تقديم الاختبار في تطوير التطبيقات الجديدة ن جيدا ولكن الاستماع، رمز اختبار هو كيف يمكن للحقيقة أن ما إذا كان إدخال الاختبار أقل المعروفة التي لا تؤدي إلى نقطة ن\nInnovation لتطبيق حالي ليس كل شيء: من أجل إدخال اختبار لن دون رمز اختبار التطبيق الحالي أو تتعايش مع التعليمات البرمجية الموجودة، ن ن [موضوع] نقاط هي تلك العقبة أعلى من اختبار وعرض للتأثير على نطاق النظر في Tari في والجدد التطبيق ن · المطورين الروبوت التطبيق المتوسطة ن - ولكن تطوير ميزة يمكن اتجاه واحد، ما إذا كان هناك أي شخص ن · رمز اختبار الانتماء للمشروع لا يوجد شعب مؤلمة ن ن [إعلان] ن · رمز اختبار من دون أي وسيلة كتبت ما يقرب من رمز اختبار ما إذا كان ن · طريقة الاختبار، ن · الفريق بأكمله أن فعل من أجل تغيير لتصميم عالية من التصميم المنخفض للن · قابلية الاختبار والتعليق ن · قابلية الاختبار من تصميم عال من إطار الاختبار في هذه الشرور لاحقا ولكن العم الكتابة الكتابة ن · الاختبار الذي تم القيام به من أجل خلق ثقافة كتابة الاختبارات",
    "speaker": {
      "id": 10,
      "name": "yuyakaido",
      "image_url": "https://pbs.twimg.com/profile_images/2882190820/d243e16b1207b4287fa5c13f5a76e4ec.png",
      "twitter_name": "yuyakaido",
      "github_name": "yuyakaido"
    },
    "stime": "2016-02-18 14:00:00",
    "etime": "2016-02-18 14:50:00",
    "category": {
      "id": 7,
      "name": "صيانة"
    },
    "place": {
      "id": 2,
      "name": "القاعة A"
    },
    "language_id": "ja",
    "slide_url": ""
  },
  {
    "id": 11,
    "title": "أدوات الروبوت ديف المعرفة",
    "description": "الجمهور المستهدف: أدوات مفيدة والأوامر من أجل تطوير\nAndroid، سخية ن · يمكن أيضا بعض الأشياء أن تستخدم في الناس ن · مبتدئين الذين يريدون أن يعرفوا المكتبة، تكون المعرفة فرضية ضرورية في فهم حركة قد لا على في أوصى ن ن نظرة عامة إلى المتوسط ​​إلى كنت ترغب في زيادة كفاءة تطوير Gashigashi باستخدام موافق ن · أدوات حتى للمبتدئين يمكن استخدام:\n سنة الأخيرة، وظهور الروبوت ستوديو وGradle، بيئة التطوير القياسية وقد تحسنت هناك كل يوم.\nAndroid ليس أساسيا في الاضطلاع الفعال لأدوات تطوير المطور وهناك أيضا الكثير.\n أدوات ن المطور الذي يمكن أن تساعد في هذه التنمية، والقيادة، وأنا أود أن أعرض دون معرفة كاملة مثل المكتبة.\n جزء في الواقع لإدخال أثناء استخدام الأداة، وما إلى ذلك متوفرة أيضا. (ورشة عمل ليكون شيء بسيط لشعبهم الذين يرغبون في الانتقال في متناول اليد) لا يكفي مجرد\nAndroid Sutdio والمساعد! لللناس ذلك، سوف يعرض أيضا أن تكون مفيدة في فهم أعمق الروبوت.\n من خلال معرفة هذه، وتحسين كفاءة التنمية الآن أكثر من أي وقت مضى، ويسرني لو تكرمتم معرفة الروبوت متعة العمق. ون ن ملموسة تتوقع شيئا على النحو المبين أدناه.\n * أوامر مفيدة (ADB، systrace.adb المتعلقة كريما) ※ 1 ن * الروبوت ستوديو البرنامج المساعد ن * Gradle المساعد ن مكتبة مفيدة * لتصحيح الأخطاء ن * آخر مفيد في تطوير أداة ن ن ※ هذه الدورة ليست سوى حوالي ADT (الروبوت أدوات المطور) ن * هذه الدورة ليست حول ADT (الروبوت أدوات المطور) ن ن ※ 1 إشارة https://github.com/operando/Android-Command-Note",
    "speaker": {
      "id": 11,
      "name": "Shinobu Okano(@operandoOS)",
      "image_url": "https://pbs.twimg.com/profile_images/2769959234/6e50270293d9b3196223e64c467f3e53.jpeg",
      "twitter_name": "operandoOS",
      "github_name": "operando"
    },
    "stime": "2016-02-18 14:00:00",
    "etime": "2016-02-18 14:50:00",
    "category": {
      "id": 6,
      "name": "البيئة وأدوات التطوير"
    },
    "place": {
      "id": 3,
      "name": "غرفة B"
    },
    "language_id": "ja",
    "slide_url": ""
  },
  {
    "id": 12,
    "title": "المتقدم الروبوت اسبرسو",
    "description": "هل اختبار؟ لا بأس إذا كنت لا - تاريخيا الأدوات لم تكن ممتاز. لكنها حصلت على أفضل من ذلك بكثير، وانا ذاهب لتظهر لك بلدي المفضل، اختبار القياس مع اسبرسو. ن نين هذا الكلام سوف تتعلم: ن * الهيكل الأساسي لاختبار اسبرسو (المنظر، ViewAction، مشاهدة التأكيد) ن * الجمع بين matchers مثل withParent، isAssignableFrom لتحديد وجهة نظركم ن * onData وRecyclerView تطبيقات ل ListView اختبار وRecyclerView ن * ViewAction مخصص وViewAssertion ن * استخدام خنجر وMockito لكتابة الاختبارات تكرار\n\n من نهاية الحديث سوف تكون الحكة لكتابة بعض الاختبارات نفسك!",
    "speaker": {
      "id": 12,
      "name": "Chiu-Ki Chan",
      "image_url": "https://pbs.twimg.com/profile_images/439937760703422464/jII8qYTL.png",
      "twitter_name": "chiuki",
      "github_name": "chiuki"
    },
    "stime": "2016-02-18 14:00:00",
    "etime": "2016-02-18 14:50:00",
    "category": {
      "id": 7,
      "name": "صيانة"
    },
    "place": {
      "id": 5,
      "name": "غرفة D"
    },
    "language_id": "en",
    "slide_url": ""
  },
  {
    "id": 13,
    "title": "تصميم التطبيق الروبوت لاطلاق سراح أسرع",
    "description": "أعتقد أن الكثير من اتجاه مصمم / مهندس الذين يشعرون عدم الكفاءة في التبادل بين المصممين والمهندسين؟ في تطوير هذا التطبيق الصيف 'سينك' الذي صدر في http://sync.wantedly.com والمصممين أيضا أثناء كتابة التعليمات البرمجية، والتي تهدف إلى الإفراج عن التطبيقات عالية الجودة في أسرع. حول قضيته، فإنه ينبغي أن يكون للقيام مصمم للتعاون أكثر فعالية؟ أعتقد أنه إذا يمكن أن أقول لكم. أو ن ن ## مواضيع مصمم \n- يجب كتابة رمز؟\\n- Matelial التصميم غالبا ما تكون أكثر كفاءة للتفاعل مع ن ن ## الهدف المصممين \n- مثل ذلك ن كنت أريد أن أقول المصممين من الكفاءة حتى أسلوب \n- · موضوع وتصميم المهندسين \n- باستخدام المهندسين تريد أن تعرف أن مصمم المصممين \n- يكافحون من أجل زيادة استنساخ للمهندسين تصميم \n- كنت تريد أن يكون في الاعتبار في تطوير التطبيقات",
    "speaker": {
      "id": 13,
      "name": "Naoki Aoyama",
      "image_url": "https://pbs.twimg.com/profile_images/780424528/yan.png",
      "twitter_name": "yanAoym",
      "github_name": "yanAoym"
    },
    "stime": "2016-02-18 15:10:00",
    "etime": "2016-02-18 15:40:00",
    "category": {
      "id": 3,
      "name": "واجهة المستخدم · التصميم"
    },
    "place": {
      "id": 2,
      "name": "القاعة A"
    },
    "language_id": "ja",
    "slide_url": ""
  },
  {
    "id": 14,
    "title": "التنمية الحديثة باستخدام Dagger2 وعالم",
    "description": "منذ الروبوت لديه رأي خاص به في العالم، مثل وضعها الطبيعي في التطبيقات JVM ليس آخر أو جزء، أن تنفذ دون تفكير عميق تنفيذ خصائص الروبوت، وسيتم الانتهاء من هو على الفور كود معقد. زيادة الطلب على تطوير التطبيقات في ن ن في السنوات الأخيرة، أصبح أبعد أيضا على نطاق أوسع. يتم زيادة وظيفة، ومن المرجح أن يكون معقدا التعليمات البرمجية.\n ن لتحجب هذا الجزء، إذا كنت تتبع يجب أن يكون تطوير التطبيقات المتضخمة، وزيادة يكن لديك للذهاب الى العمل من خطر كود معقد، كما أنه يصبح وأضافت وظيفة بيئة صعبة. من أجل ن ن لا ينتج رمز معقدة، والقضاء على التبعية، لكتابة رمز الإختبار هو قاعدة أساسية. وما إلى ذلك بالإضافة إلى أن آخر من إعادة توليد، يجب أن يكون هناك المقابلة تماما لسلوك إطار الروبوت. لن ن هذه المسألة، ليس هناك لا تكون ايضا قادرة على حل من تلقاء نفسها. ولكن لحسن الحظ، في عام 2015 حاليا، وكانت مكتبة مفيدة المتاحة في الروبوت عدد كبير المتاحة. نحن نراجع المكتبات المختلفة، من خلال الجمع بين نتائج 'Dagger2' 'عالم'، الإطار وكذلك الانسجام وقوية، للقضاء على أكبر قدر من الاعتماد ممكنة، ونحن ابتكر طريقة لتطوير المنتجات القابلة للقياس تريد كان عليه. وآخر نسي في ن ن تطوير التطبيق الذي يجب أن لا، هو المفاضلة مع الجانب الخادم. وخصوصا عندما صنع كل جانب الخادم الجديد، وليس دائما مع تصميم API هو قبل التنفيذ إلى تطبيق العميل.\n ن هذه الحالة لا يعتبر، لأن لوقف العمل في الجانب تطبيق العميل، فعليك أن تأخذ نوعا من التدابير.\n ن لذلك نحن على استعداد الخادم كعب، وتوفير نقطة النهاية المؤقت تطوير الجانب الإلكترونية المستقلة. كنا قادرين على تحقيق غاية بيئة التطوير عالية السرعة. محتويات ن ن هذه الدورة، وأعتقد أنه يساعد الجميع سعداء اذا كنت حتى قليلا.",
    "speaker": {
      "id": 14,
      "name": "Ryo Kitamura",
      "image_url": "",
      "twitter_name": "",
      "github_name": ""
    },
    "stime": "2016-02-18 15:10:00",
    "etime": "2016-02-18 15:40:00",
    "category": {
      "id": 8,
      "name": "أحدث التطورات في الروبوت"
    },
    "place": {
      "id": 3,
      "name": "غرفة B"
    },
    "language_id": "ja",
    "slide_url": ""
  },
  {
    "id": 15,
    "title": "تقنيات تطوير التطبيقات الفعالة في بيئة ويندوز",
    "description": "في مجال تقنيات تطوير التطبيقات كفاءة ن ○ ملخص] ن للدولة من بين الفن تطوير الروبوت التطبيق في بيئة ▪️Windows أعتقد أن في كثير من الأحيان قد تستخدم ماك لأجهزة الكمبيوتر الشخصية التنمية.\n جلسة الدراسة ستكون أو ينظر العديد من المطورين لجلب ماك، وما إلى ذلك، ثم اطلب الفعلية في مجال التنمية لا يزال العديد من المطورين الذين يعملون على تطوير في بيئة ويندوز.\n معلومات ليتم نشرها على بلوق وqiita وستاكوفيرفلوو على شبكة الإنترنت الكثير من المعلومات من أولئك الذين يستخدمون ماك السابق، كنت قد شعرت هذه الحالة عن طريق تناول ويندوز معلومات المستخدم من تطوير التطبيق الروبوت ليست كافية. من خلال طرح مثل هذا مستخدم Windows تتعثر السهل إلى نقطة ونقطة صعبة من الروبوت أثناء تطوير التطبيق، أو يمكن تجنب الحمرية نقاط رخيصة، أو تعزيز كفاءة التنمية، أو يمكن أن يكون تطورا كبيرا ماك حتى ويندوز، ماك إدخال قضية أو لا يمكن أن يكون.\n ن ○ [جدول مقترح المحتويات] ن · الروبوت SDK تحميل، أفضل الممارسات ن من مدير SDK لتحميل ومسار وضع البيئة ن · نقطة في وقت الروبوت ستوديو التركيب ن · الروبوت محطة من إعدادات برنامج تشغيل، مثل · استخدام الروبوت المحاكي في ذلك الوقت على كيفية إعداد ن · بوابة كيفية استخدامها. بوابة للنوافذ، sourceTree (GUI)، جيثب سطح المكتب، سيغوين، والاستفادة من طريقة لن · الروبوت استوديو للتخصيص لوحة المفاتيح، مثل سه أو HTTPS (قبعات السيطرة، مجموعة الولايات المتحدة، ويضيف إعداد اختصار) ن · جيثب، واستخدام هذا bitbucket حل ن لدرجة ن · apktools، التنفيذ المباشر لجافا، مثل أدوات التحليل الاستفادة من كيف ن · مشكلات Windows محددة من الوقت",
    "speaker": {
      "id": 15,
      "name": "tarotaro",
      "image_url": "https://pbs.twimg.com/profile_images/1610666375/icon.png",
      "twitter_name": "tarotaro4",
      "github_name": ""
    },
    "stime": "2016-02-18 15:10:00",
    "etime": "2016-02-18 15:40:00",
    "category": {
      "id": 6,
      "name": "البيئة وأدوات التطوير"
    },
    "place": {
      "id": 4,
      "name": "غرفة C"
    },
    "language_id": "ja",
    "slide_url": ""
  },
  {
    "id": 16,
    "title": "آلية لتنفيذ تشغيل الفوري",
    "description": "ميزات جديدة لحظة يصبح محور الروبوت ستوديو 2.0 تشغيل ما تم كيفية تحقيقه، يقول IDE كيف حزمة التطبيق الروبوت، تثبيت، من الناحية النظر عما إذا كنت التصحيح. منذ آلية تشغيل الفوري في حد ذاته هو غير العام في نوفمبر تشرين الثاني، وإذا كان غير جمهور حتى فبراير، ويقول في تخمين على أساس من التكنولوجيا المماثلة القائمة.\n ن الجمهور المستهدف: إطار والمطورين الذين يرغبون في آلية أداة للتنمية",
    "speaker": {
      "id": 16,
      "name": "Atsushi Eno",
      "image_url": "https://pbs.twimg.com/profile_images/633074634435379200/qJu6ECTX.jpg",
      "twitter_name": "atsushieno",
      "github_name": "atsushieno"
    },
    "stime": "2016-02-18 15:10:00",
    "etime": "2016-02-18 15:40:00",
    "category": {
      "id": 6,
      "name": "البيئة وأدوات التطوير"
    },
    "place": {
      "id": 5,
      "name": "غرفة D"
    },
    "language_id": "ja",
    "slide_url": ""
  },
  {
    "id": 17,
    "title": "الرسوم المتحركة كيفية تنفيذ للتطبيق الخاص بك",
    "description": "[موضوع] مبتدئين nAndroid تطوير التطبيق إلى متوسط ن ن [ملخص] النسخة\nAndroid يتم زيادة، ازداد كثيرا أيضا آلية للرسوم المتحركة. دغة N بشأن ما إذا كان القول بأن الرسوم المتحركة نقل محتويات الملف، أو نقل الملف نفسه، وهناك عدة أو إرجاع كل تخطيط ن. إطار nAndroid لكننا نستعد آلية في كل منهما، هناك ما هو في والتبعيات التي تتكرر في السطح ن وظيفة، فإنه من الصعب أن نرى كيف أنه من الأفضل لجعل مجموعة مختارة من لا شيء إلى تنفيذ قريبا ن الآن كان المستخدمون قادمة. من ن عدد ن بعض الرسوم المتحركة عن كيفية عملها في هذا الإعلان، حول ما يجب علي أن أستخدم وهو ن أي تطبيقات، سوف نتحدث عن ن مفهوم ونهج.\n ن [الكلمة]\n- Drawable الرسوم المتحركة\n- مشاهدة الرسوم المتحركة\n- الرسوم المتحركة الممتلكات،\n- الانتقال الرسوم المتحركة\n- Actvity / قطعة الانتقالية",
    "speaker": {
      "id": 17,
      "name": "住友 孝郎",
      "image_url": "https://pbs.twimg.com/profile_images/628217025492484096/ppW0QfNn.png",
      "twitter_name": "cattaka_net",
      "github_name": "cattaka"
    },
    "stime": "2016-02-18 15:50:00",
    "etime": "2016-02-18 16:20:00",
    "category": {
      "id": 3,
      "name": "واجهة المستخدم · التصميم"
    },
    "place": {
      "id": 2,
      "name": "القاعة A"
    },
    "language_id": "ja",
    "slide_url": ""
  },
  {
    "id": 18,
    "title": "التفكير في إنقاذ السلطة من الروبوت",
    "description": "الجمهور المستهدف: المتوسط (ما وراء خطوة لجعل ببساطة، وصلت إلى عدد أكبر من الناس في المرحلة التي دعونا نفكر في المستخدم) ن ن الوصف: مجموعة متنوعة واسعة، بما في ذلك\nAndroid في تلك الملكية السابقة وقد تم إدخال ميزات لتوفير الطاقة. بعض الأشياء التي أدخلت على الروبوت كله، مثل فرص العمل المبرمج والاستشعار للتجزئة، وكان هناك أيضا الملكية الميزات الموفرة للطاقة. وهناك أيضا الدراية من المبادئ التوجيهية لتصميم توفير الطاقة.\n ن مع مراعاة تاريخهم، ونحن نقدم لك طريقة نعس والتطبيقات الاستعداد هو ميزة جديدة موفرة للطاقة التي تم تقديمها في الروبوت 6.0. من أجل\n ن أيضا أولئك الذين يقتصر مشكلة على الاطلاق من قبل تلك الموفرة للطاقة، ويوضح أيضا كيفية تجنب والتخفيف من آثارها.",
    "speaker": {
      "id": 18,
      "name": "Yoshiaki Nakanishi",
      "image_url": "https://pbs.twimg.com/profile_images/933874847/chun_ryo.jpg",
      "twitter_name": "chun_ryo",
      "github_name": "ynakanishi"
    },
    "stime": "2016-02-18 15:50:00",
    "etime": "2016-02-18 16:20:00",
    "category": {
      "id": 8,
      "name": "أحدث التطورات في الروبوت"
    },
    "place": {
      "id": 3,
      "name": "غرفة B"
    },
    "language_id": "ja",
    "slide_url": ""
  },
  {
    "id": 19,
    "title": "المقابلة لفترة انتقالية من طراز إذن",
    "description": "[ملخص] نموذج جديد أذونات في nAndroid6.0 (إذن وقت التشغيل) بجانب، أو التصريح اللازم أن تصبح في وقت الجولة الأولى، فمن الممكن لإلغاء في وقت لاحق، مثل، تم تغيير بشكل كبير مع النموذج تصل إلى ن الآن. على الرغم من أن ن، والوضع الحالي هذا النموذج الجديد من فوائد الخضوع التام لإرادة، على محطة للAndroid6.0، فقط عند تحريك targetSDKversion التطبيق = 23.\n لفترة من الوقت أفضل بكثير من تثبيت محطة 6.0 أو في وقت سابق من الروبوت، يجب أن تفكر في المراسلات.\n وبالإضافة إلى ذلك، من المقرر أن التغييرات هو نموذج كبير، أيضا أن تأخذ مشاريع الوقت للرد بشكل كامل إلى Android6.0 يفترض.\n خلال هذه الفترة الانتقالية، سوف يعلمك حول هذه التقنية لذلك لا يسبب مشكلة في الصلة إذن.\n ن [موضوع]\nAndroid المقابلة لأفضل الممارسات ن Android5.1 محطة سابقة للإذن ن وقت التشغيل للمطورين التطبيق المبتدئين للمستخدم المتوسطة ن ن [المحتويات] إذن ن وقت التشغيل كيفية targetSDKVersion = 23 التطبيقات لا يمكن أن يكون حول كيفية جعل ن targetSDKVersion = 23 التطبيق من لا يسبب مشكلة في محطة للAndroid6.0",
    "speaker": {
      "id": 19,
      "name": "aki_sh_7",
      "image_url": "https://pbs.twimg.com/profile_images/633665268430934017/yVu6Wcru.jpg",
      "twitter_name": "aki_sh_7",
      "github_name": ""
    },
    "stime": "2016-02-18 15:50:00",
    "etime": "2016-02-18 16:20:00",
    "category": {
      "id": 7,
      "name": "صيانة"
    },
    "place": {
      "id": 5,
      "name": "غرفة D"
    },
    "language_id": "ja",
    "slide_url": ""
  },
  {
    "id": 20,
    "title": "ترميز آمن ليوم غد، لا خسارة",
    "description": "الهدف: الناس الذين يهتمون في إطار النظيفة عمارة / MVP. الناس ن\n- نظرة عامة يريد تنظيف تطبيق Android: ن وينظم صيانة عالية، الإطار الروبوت، وتريد أن تعمل على مدونة مصدر نظيف! ولقد اعتقدت دائما. إطار عمل ل. ون نسخة\nAndroid أعتقد أنه كان هناك وجود متزايد للحديث الروبوت النظيفة العمارة. بغض النظر عن اليابانية والانكليزية للأدلة، فإننا كثيرا ما نرى ملخص (ماذا / لماذا) ورمز العام.\n ن ومع ذلك، فإنه يبدو أن لا اختراق حتى الان. لماذا؟ باعتبارها واحدة من الأسباب، من استشراف أرتشيتيكوري، أو لن لأن الرمز الفعلي لتراجع عن البرنامج التعليمي (كيف) هو صغير.\n\n حتى نفسي خلقت التطبيق إلى المرجعية، ولكن انخفض إلى التنفيذ والعمل المضني للغاية. عدة مرات وكسر قلبي. ومع ذلك، ننظر إلى الوراء بعد واحدة من خلال تنفيذ أكثر، وجدت لتكون العمارة فعالة للغاية.\n ن وهكذا، Itadakitaku باستخدام جميع الوسائل هذا أرتشيتيكوري، إلى خفض عتبة الأولية لذلك، أود أن أشرح في خطوة بخطوة.\n لتنفيذ محتويات محددة النوعين n ListView N- وفاب فقط التطبيق ن - عندما يكون هذا التطبيق اضغط فاب، ورمي طلب إلى API، هو التطبيق البسيط الذي يعرض النتائج على يكون ListView . إلى التفكير في كيفية البيانات على مدى الوقت إذا استجابة النوعين n أو تتلقى رمي لإنشاء طلب في الوقت أو\n- فاب الضغط الفجوة الملف في وقت لخلق شاشة النوعين n، في شكل مثل واحد ن ن لتحديث الشاشة، وأود أن نتحدث عن كيفية تنفيذ عملية خطوة بخطوة من التطبيق الفعلي.",
    "speaker": {
      "id": 20,
      "name": "kengoscal",
      "image_url": "https://pbs.twimg.com/profile_images/619114313819688960/F-6mzriO.jpg",
      "twitter_name": "kengoscal",
      "github_name": "ken5scal"
    },
    "stime": "2016-02-18 16:30:00",
    "etime": "2016-02-18 17:00:00",
    "category": {
      "id": 7,
      "name": "صيانة"
    },
    "place": {
      "id": 2,
      "name": "القاعة A"
    },
    "language_id": "ja",
    "slide_url": ""
  },
  {
    "id": 21,
    "title": "الممارسة! الروبوت ستوديو المكونات في التنمية",
    "description": "أصبح الروبوت استوديو IDE يجب الآن ليس في تطوير الروبوت. مفيدة المكونات الإضافية هي أيضا غنية في الأماكن العامة، ولكن أعتقد أن لا يشارك الكثير من المعرفة حول أسلوب التنمية. عندما كنت وضعت نفسي في المكونات لالسابق، مزيد من المعلومات التمهيدية كافحت أقل.\nhttps: ل//github.com/konifar/android-material-design-icon-generator-plugin ن ن أندرويد للمطورين الذين 'لا يعرفون ما يجب القيام به حتى لو كان هناك فكرة مفيدة المكونات الإضافية'، حتى من تلقاء نفسها سنتحدث تحصل على نشعر أنه من المرجح أن تجعل. سبق لي أن كتبت مقالا التمهيدية، أود أن أتطرق إلى محتوى عملي أكثر قليلا من هذا.\nhttp: //qiita.com/konifar/items/c6e23921ffec475907fc ن ن [موضوع] هناك في المكونات التي أريد أن الناس ن · جعل مدينون لن · المكونات في الناس ن · الروبوت ستوديو المفضلة شخص ن ن [محتويات] ن · نوع من كيفية جعل (رمز جيل، وشاشة عرض، ملف التلاعب، الخ) كيف معرفة ن · مشروع Gradle تنفيذ المكونات في تريد إنشاء ن · وCI ن · Kotlin طريقة إدخال",
    "speaker": {
      "id": 21,
      "name": "konifar",
      "image_url": "https://pbs.twimg.com/profile_images/619379391588511744/V4RrXbvM.jpg",
      "twitter_name": "konifar",
      "github_name": "konifar"
    },
    "stime": "2016-02-18 16:30:00",
    "etime": "2016-02-18 17:00:00",
    "category": {
      "id": 6,
      "name": "البيئة وأدوات التطوير"
    },
    "place": {
      "id": 3,
      "name": "غرفة B"
    },
    "language_id": "ja",
    "slide_url": ""
  },
  {
    "id": 22,
    "title": "بناء بيئة المنصوص عليها في gradle لا يخاف وبازل",
    "description": "أريد القيام به ليشعر حقا جيدة لبناء خلال أكثر gradle متنوعة أنا تستخدم بقايا في بناء نظام gradle ن الافتراضي، والذي يستخدم في أندرويد استوديو! الدورة هي ن ن هذا في جلسة لتصحيح الأخطاء من الإنشاء اتقان gradle، وخلق الإنتاج لAPK، ذهبنا فعلا بناء في بازل، الذي جذب انتباه كتوقيع والجديدة الانطباعات بناء نظام لأولئك الذين يعتقدون أن ومن المتوقع أن يكون الحديث ع",
    "speaker": {
      "id": 22,
      "name": "Tatsuya Shimada",
      "image_url": "https://pbs.twimg.com/profile_images/611831596581130240/vNdSioTF.jpg",
      "twitter_name": "usaganikki",
      "github_name": ""
    },
    "stime": "2016-02-18 16:30:00",
    "etime": "2016-02-18 17:00:00",
    "category": {
      "id": 6,
      "name": "البيئة وأدوات التطوير"
    },
    "place": {
      "id": 5,
      "name": "غرفة D"
    },
    "language_id": "ja",
    "slide_url": ""
  },
  {
    "id": 23,
    "title": "دعم دليل المكتبة | دعم مكتبة الداخلية",
    "description": "",
    "speaker": {
      "id": 23,
      "name": "Yuichi Araki",
      "image_url": "https://avatars2.githubusercontent.com/u/1237536?v=3&s=400.jpg",
      "twitter_name": "yuichi_araki",
      "github_name": "yaraki"
    },
    "stime": "2016-02-19 10:00:00",
    "etime": "2016-02-19 11:00:00",
    "category": {
      "id": 1,
      "name": "محاضرة رئيسية"
    },
    "place": {
      "id": 1,
      "name": "المكان الرئيسي"
    },
    "language_id": "ja",
    "slide_url": ""
  },
  {
    "id": 24,
    "title": "دور المهندسين الروبوت وانتقالها في COOKPAD",
    "description": "الجمهور المستهدف: الناس الذين يشاركون في فريق تطوير تطبيقات الجوال، الذين ينقادون، في الوقت الذي أنا الشعب ن ن التي تريد أن تجعل في الفريق في المستقبل وانضم COOKPAD في أكتوبر 2013، في بيت المهندسين 60 شخصا كان المهندسون الروبوت ثلاثة أشخاص وأنا من بينهم ضد عنه. المهندسين الروبوت أكثر من 10 شخصا في الوقت الحاضر، وفريق المحمول بأكمله، بما في ذلك دائرة الرقابة الداخلية وضمان الجودة نمت إلى 25 شخصا.\n\n حتى الآن من مهندس المحمول 0-1 الناس عصر قبل انضمامي، وكيفية مواجهة ما يتحدى فريق المحمول، وتتحدث عن ما حدث من العمل على تحسين في السلسلة الزمنية. وسيكون موضع تقدير كبير اذا Yakudatere لتحسين بناء عملية التنمية النقالة.\n\n- 2012/04 الكامل الصفر\n- 2014/04 المحمول إنشاء الغرفة الأولى من التطبيق الهجين عصر\n- 2013/10 الأصلية هي ن - صيانة ن لعملية التنمية - تحسين جودة ن - تحسين البيئة\n- 2015/01 المحمول الأول حل غرفة للتنمية النقالة، فريق البنية التحتية المحمول المنشأة حديثا ن - تعزيز تطوير منصة\n- تم 2016 سنة المحمول - تعظيم ن قيمة الطرد خدمة كل شعبة مستقبل المهندسين المحمول -",
    "speaker": {
      "id": 24,
      "name": "sys1yagi",
      "image_url": "https://pbs.twimg.com/profile_images/562623123518787584/st_WXQ8e.png",
      "twitter_name": "sys1yagi",
      "github_name": "sys1yagi"
    },
    "stime": "2016-02-19 11:30:00",
    "etime": "2016-02-19 12:00:00",
    "category": {
      "id": 2,
      "name": "آخر"
    },
    "place": {
      "id": 2,
      "name": "القاعة A"
    },
    "language_id": "ja",
    "slide_url": ""
  },
  {
    "id": 25,
    "title": "ترويض تولد من جديد واجهة المستخدم الأوتوماتيكية",
    "description": "● أداة اختبار قيمة 'واجهة المستخدم الأوتوماتيكية' هو أنه يمكنك أيضا اختبار تطبيقات نظرة عامة ن وقعت الآخرين، كجزء من مكتبة دعم اختبار الروبوت، قد تغيرت ولدت من جديد مارس 2015 (UI الأوتوماتيكية 2). في نوي الأوتوماتيكية 2، بالإضافة إلى أصبح أفضل التوافق مع الروبوت ستوديو، فقد تضاعف API المتاحة.\n ن ومع ذلك، قد يكون هناك كمية صغيرة من وصف وثيقة رسمية، وأنا لا أرى تماما الصورة كاملة من وظائف واجهة المستخدم الأوتوماتيكية 2 لهذا العرض. على وجه الخصوص، أن UiObject وUiObject2، ما يقرب من الطبقات التي توفر نفس الوظائف أن تتعايش اثنين، حفزت صعوبة مفهومة. في ن ن هذا الإعلان والخبرة وفي حد ذاته حاولت استخدام واجهة المستخدم الأوتوماتيكية 2، استنادا إلى المحتوى الذي قراءة رمز تنفيذ واجهة المستخدم الأوتوماتيكية 2، لحل المسألة على النحو التالي.\n\n- أدخلت حديثا UiObject2 هل UiObject وما هو الفرق؟ هل هو جيد عدم استخدام UiObject العمر N-؟ ما هو أنه يمكنك الآن تحولت حديثا N- UI الأوتوماتيكية 2؟\n- واجهة المستخدم في مكان ما بعيدا عن استخدام الأوتوماتيكية 2؟ ما هي الأشياء أن نأخذ في الاعتبار عند كتابة الاختبار باستخدام N- UI الأوتوماتيكية 2؟\n ن ● نكتب الآلي للاختبارات من خلال الاستفادة من يحاكم شخص\n- اسبرسو باستخدام موضوع\n- الروبوت المتوسطة ~\n- الروبوت من الأجهزة اختبار، ولكن كذلك عرض للاختبار من أجل\n ن ● 3 نقطة واحدة للعرض لأولئك الذين يريدون لنشر ن محددة الروبوت N-: محتويات واجهة المستخدم الأوتوماتيكية 2 هي أداة اختبار ن الروبوت القياسية.\n\n- الخبرة: ل ن واجهة المستخدم الأوتوماتيكية 2، يتم نشر المعلومات حول مثال بسيط بعض، ولكن ليس أكثر من العثور على السؤال أعلاه للإجابة على مثل هذه الأمور.\n ※ نفسها ABC 2015 شريحة [1]، والتي نشرت في الصيف، ولكن المقصود هو الإجابة على السؤال أعلاه، هذا العرض، كان أبعد عميق، سيكون بالإضافة إلى المعرفة التي تم الحصول عليها حديثا.\n ن [1] 'ما الذي تغير في أداة التشغيل الآلي للاختبار واجهة المستخدم الأوتوماتيكية 2.0' https://speakerdeck.com/sumio/notable-changes-in-ui-automator-2-dot-0\n\n- الابتكار : ن واجهة المستخدم الأوتوماتيكية 2 من فهم عميق لكيفية كتابة الاختبارات باستخدام، يمكنك تقليل عقبة نفسية لأتمتة الاختبارات واجهة المستخدم مثل للعمل مع التطبيقات التي وقعت الآخرين.",
    "speaker": {
      "id": 25,
      "name": "@sumio_tym (TOYAMA Sumio)",
      "image_url": "https://pbs.twimg.com/profile_images/1564001253/bf.jpg",
      "twitter_name": "sumio_tym",
      "github_name": "sumio"
    },
    "stime": "2016-02-19 11:30:00",
    "etime": "2016-02-19 12:00:00",
    "category": {
      "id": 7,
      "name": "صيانة"
    },
    "place": {
      "id": 3,
      "name": "غرفة B"
    },
    "language_id": "ja",
    "slide_url": ""
  },
  {
    "id": 26,
    "title": "عرض في الهاوية",
    "description": "والتعليق من الأساس لأدنى عنصر 'إرسال' التي تشكل شاشة من التطبيق الروبوت.\n أو تجميعها كيف أثناء تشغيل تخطيط مشاهدة التي تمت كتابتها في XML، فمن المحاضرة بالنسبة لأولئك الذين يرغبون في مبدأ التشغيل الفعلي لا تقتصر على فندق nhow ل. لن ومن المقرر الرئيسي ليتكلم التالية لمزيد من المعلومات حول نقطتين.\n\n شاهد شجرة بناء تخطيط ورسم آلية\n- onMeasure، onLayout، وظيفة onDraw\n- requestLayout، وكيفية جعل يبطل\n- عرض مخصص ومخصص ViewGroup\n\n شاهد تحسين الأداء\n- لا لزوم لها إعادة تخطيط لأو إعادة رسم لتجنب طبقة الجهاز\n- (إذا كان هناك غرفة)",
    "speaker": {
      "id": 26,
      "name": "Masaki Mori",
      "image_url": "",
      "twitter_name": "",
      "github_name": ""
    },
    "stime": "2016-02-19 11:30:00",
    "etime": "2016-02-19 12:00:00",
    "category": {
      "id": 5,
      "name": "منصة"
    },
    "place": {
      "id": 4,
      "name": "غرفة C"
    },
    "language_id": "ja",
    "slide_url": ""
  },
  {
    "id": 27,
    "title": "تجهيز الشرح في الروبوت",
    "description": "تجهيز الشرح هو تقنية جافا المتطورة التي يمكن استخدامها في الروبوت للفوائد العظيمة. في هذه الدورة سوف تتعلم الأساسية، نرى بعض الأمثلة وتعلم الكتابة واحدة نفسك مع وحدة الاختبارات المناسبة!",
    "speaker": {
      "id": 27,
      "name": "Emanuele Zattin",
      "image_url": "https://pbs.twimg.com/profile_images/378800000371179906/a7d0cc0650810f62c51786b8d889fbf4.png",
      "twitter_name": "emanuelez",
      "github_name": "emanuelez"
    },
    "stime": "2016-02-19 11:30:00",
    "etime": "2016-02-19 12:00:00",
    "category": {
      "id": 5,
      "name": "منصة"
    },
    "place": {
      "id": 5,
      "name": "غرفة D"
    },
    "language_id": "en",
    "slide_url": ""
  },
  {
    "id": 28,
    "title": "تخصيص موضوع وأسلوب لتصميم المواد",
    "description": "هل يمكن الاستفادة من الموضوعات والأساليب؟ ون ن هذه الجلسة يشرح أساسيات الأول على غرار موضوع، سوف أعرض الصحيح كيفية تخصيص موضوع لهذا التطبيق. ثم والميزات التي تمت إضافتها في الإصدار الجديد، مثل الشفافية في شريط الحالة، سوف أعرض كيفية تحديد لعزلهم عن كل إصدار. وأخيرا، فإننا سوف ننظر في نمط موضوع لتحقيق تصميم المواد، والذي يتوفر في AppCompat. استخدام مع AppCompat ليس colorPrimary فقط وcolorAccent. مثل القطعة وTextAppearance، أنها على استعداد أيضا أشياء مختلفة المفيد تحديد مباشرة في XML التخطيط. وسوف نقدم هذه التعاريف وطرق الاستفادة منها.\n\n\n الموضوع\n- على غرار موضوع استخدام بطريقة أو بأخرى من قبل الناس\n- AppCompat كنت تريد أن تعرف سمات موضوع المضافة في الناس إصدار جديد N- كنت تريد أن تعرف الناس\n- طرق تخصيص الصحيحة الناس الذين يرغبون في الاستفادة من أسلوب",
    "speaker": {
      "id": 28,
      "name": "Yuki Anzai (yanzm)",
      "image_url": "https://pbs.twimg.com/profile_images/628030087460327424/0oNNWTBN.png",
      "twitter_name": "yanzm",
      "github_name": "yanzm"
    },
    "stime": "2016-02-19 13:00:00",
    "etime": "2016-02-19 13:50:00",
    "category": {
      "id": 3,
      "name": "واجهة المستخدم · التصميم"
    },
    "place": {
      "id": 2,
      "name": "القاعة A"
    },
    "language_id": "ja",
    "slide_url": ""
  },
  {
    "id": 29,
    "title": "لجعل التطبيق الروبوت في السعي لتحقيق الأداء",
    "description": "استهداف: إذا كان لديك خبرة في تطوير التطبيق الروبوت. على وجه الخصوص، وأنا (أتاشي) ويعتقد أن هناك أكثر من أعرفه من اليسار إلى تطوير الروبوت لك. ون تقنية\nAndroid لتحسين أداء التطبيقات من وصف شامل في مختلف وجهات النظر.\n جلسة أداء حصلت على فكرة لبناء تطبيقات عالية الجودة في السعي ل.\nTOPIC: من أجل تحسين أداء وحدة المعالجة المركزية النوعين n من أجل تحسين أداء الذاكرة\n- من أجل تحسين أداء المبدأ الأساسي للUI N- حول أداء في التطبيق الروبوت N- N- من أجل تحسين أداء\n- خردوات من أجل تحسين أداء البطارية ل",
    "speaker": {
      "id": 29,
      "name": "t.egg",
      "image_url": "",
      "twitter_name": "",
      "github_name": ""
    },
    "stime": "2016-02-19 13:00:00",
    "etime": "2016-02-19 13:50:00",
    "category": {
      "id": 7,
      "name": "صيانة"
    },
    "place": {
      "id": 3,
      "name": "غرفة B"
    },
    "language_id": "",
    "slide_url": ""
  },
  {
    "id": 30,
    "title": "كاميرا الروح التطبيق القتال",
    "description": "وKarekore تم الافراج عن سنة واحدة سيتم تعيين API Camera2 ولكن، ربما لأن هناك ودود سيئة وقال أيضا تصميم واجهة برمجة التطبيقات ورد الجحيم، لم يكن لديك الحالة التي شعبية جدا من ذلك بكثير. أو أن نقول من الآن لاستخدام API الكاميرا هو، <ديل>، مثل فقدان إلى شيء </ دل> سوف يكون من الصعب أيضا إهمال API شهادة بذلك. في ن ن هذه الدورة، الدورة، على تصميم، مثل التقاط، ويصف المفاهيم الهامة، 'كان من المفترض أنا، لا يحتمل أن تستخدم إذا كان هذا' للقضاء على الشر من ودود من Camera2 API التي تحصل على التفكير فهو يصف Camera2 API لهذا الغرض. إذا ن نابي نظرة، كتطبيق جديد للكاميرا، على سبيل المثال، من أجل تلبية مثل لاطلاق النار مستمر أثناء تغيير التعرض يطلق النار المعلمات، خرج مفهوم خط الانابيب. والفكرة هي أن الناس في تطبيق الكاميرا مهتمون لأنه لا يمكن بشكل جيد جدا كتصميم لمتابعة الأداء، وبطبيعة الحال، وأعتقد أنه سيكون من المفيد كنموذج تصميم API غير متزامن",
    "speaker": {
      "id": 30,
      "name": "mhidaka",
      "image_url": "https://pbs.twimg.com/profile_images/638564112922882048/a0ZPWdgO.png",
      "twitter_name": "mhidaka",
      "github_name": "mhidaka"
    },
    "stime": "2016-02-19 13:00:00",
    "etime": "2016-02-19 13:50:00",
    "category": {
      "id": 4,
      "name": "خردوات"
    },
    "place": {
      "id": 4,
      "name": "غرفة C"
    },
    "language_id": "ja",
    "slide_url": ""
  },
  {
    "id": 31,
    "title": "المحبة تخطيط العجاف",
    "description": "تخطيطات XML هي جزء أساسي من تطوير الروبوت على جميع المستويات. الشروع في العمل واضحة ولكن إنشاء تخطيطات كفاءة في حين لا يزال تحقيق واجهة المستخدم المطلوب يحتاج إلى بعض الممارسات وبعض الحيل. ن نين هذه الدورة سوف ننظر في إنشاء تخطيطات بعد الجميلة الخالية من الدهن ومناقشة لماذا يهم تخطيطات فعالة لكل من المطورين والمستخدمين، النظر في حالات الاستخدام وأفضل الممارسات لتخطيطات القياسية، تحديد متى وجهة نظر العرف هو خيار جيد، ومراجعة الأخطاء والمفاهيم الخاطئة الشائعة، وتبادل بعض الحيل والتقنيات الظرفية.",
    "speaker": {
      "id": 31,
      "name": "Huyen Tue Dao (Queen Code Monkey)",
      "image_url": "https://pbs.twimg.com/profile_images/1774774856/Avatar_DragonCon_300x300.jpg",
      "twitter_name": "queencodemonkey",
      "github_name": "queencodemonkey"
    },
    "stime": "2016-02-19 13:00:00",
    "etime": "2016-02-19 13:50:00",
    "category": {
      "id": 5,
      "name": "منصة"
    },
    "place": {
      "id": 5,
      "name": "غرفة D"
    },
    "language_id": "en",
    "slide_url": ""
  },
  {
    "id": 32,
    "title": "مراجعة الكلي مكتبة الدعم",
    "description": "[ملخص] ن وقد تم تحديث SupportLibrary أولا لقد تم الافراج عن مراجعة 1 مارس 2011. ووفقا للموقع الرسمي، في عام 2015 من نوفمبر تشرين الثاني لمراجعة 23.1.1. في البداية، بدأت مع واحد من مكتبة دعا V4، الآن هناك العديد SupportLibrary مثل V7 والتصميم، والعدد سيرتفع إلى أكثر وأكثر.\n هذه الدورة، ما SupportLibrary هناك، يوضح أي نوع من وظيفة يمكن أن تتحقق، وتساعد على أن تصبح المحتوى لترويض SupportLibrary.\n مظاهرة السلوك ن من [موضوع]\nAndroid مبتدئين تطوير التطبيق إلى متوسط ن ن [محتويات المرشح] من\n- كل وظيفة SupportLibrary إلى تقديم التعليق\n- السمات الرئيسية",
    "speaker": {
      "id": 32,
      "name": "Yoshihiro Shimokawa",
      "image_url": "https://pbs.twimg.com/profile_images/512589372013547521/BDOLFGH_.jpeg",
      "twitter_name": "androhi",
      "github_name": "androhi"
    },
    "stime": "2016-02-19 14:00:00",
    "etime": "2016-02-19 14:50:00",
    "category": {
      "id": 7,
      "name": "صيانة"
    },
    "place": {
      "id": 2,
      "name": "القاعة A"
    },
    "language_id": "ja",
    "slide_url": ""
  },
  {
    "id": 33,
    "title": "Kotlin المتقدم لالروبوت",
    "description": "■ نظرة عامة ن ن الآن، وتتحدث عن تطوير الروبوت بسبب لغة البرمجة اجتذبت Kotlin اهتمام من جميع أنحاء العالم (Kotorin).\nKotlin لغة وجوه المنحى كتبته بشكل ثابت، تم تطويرها من قبل JetBrains، وشركة، ويتميز بناء الجملة مألوفة لدى المبرمجين جافا.\n كانت آخر مرة مقدمة موجزة في DroidKaigi، وهذه المرة في خطوة واحدة المحتوى المتقدمة، والإسهام في مستوى المتابعة للمستخدم الروبوت Kotlin. على الرغم من أن\nver0.x اتبعت منذ فترة طويلة، الحالي ver1.0 بيتا، نهاية السنة هي الآن يتم تحريرها أهم الشائعات التي تحدثت عن نسخة مستقرة 1.0!\n\nAndroid محددة: وشملت\nKotlin أيضا لاستهداف آلة جافا الافتراضية، فضلا عن الروبوت.\n ولكن Kotlin المشكلة أن ما يسمى تواجه الروبوت جافا لنا لقرار الرائعة.\n\nExpertise:\nKotlin لا يزال على القليل من المعلومات لا يمكن القول أن تكون التكنولوجيا الكبرى، والتقدم في وقت مبكر، وتغير. وسيتم الإعلان عن N المبشر باللغة اليابانية (التي نصبت نفسها).\n\nInnovation: يبدو أن يحصل تصبح مبالغ فيه ويقولون ان هناك عددا كبيرا الابتكار ن. قصة هذا الاتجاه لأن التطبيق هو موضح في nKotlin لا توجد مقارنة الإنتاجية وnJava، والصيانة، لأنه هو مفيد من حيث السلامة، أو التركيز على واجهة المستخدم وظائف في الوقت ن والأسرة يا المتبقية يمكنك أيضا قضاء بعض الوقت مع الأصدقاء.\n\n ■ وصف للموضوع ن · الروبوت المتوسطة ~ ن · Kotlin مبتدئين ~ ن ن بدائية Kotlin تقريبا أي (إلى نهاية الفاصلة المنقوطة الجملة غير مطلوب! الخ).\n ولكن المواد عرضها على الجمهور، ومن المقرر ان يتوجه بقدر الممكن متابعة هذا كما هو موضح في بلوق.\n\n ■ المحتويات مشروع\n1. وKotlin نظرة عامة ن · Kotlin حل المشكلة التي هي وجه من السهل في خلاصة ن\n2. نصائح مجموعة ن · تطوير الروبوت ون · خلفية خاطفة والنحوي في Kotlin لن · ميزات بالتزامن مقدمة ن لغة Kotlin ذات الصلة و N3. مكتبة، مثل ن · Dagger2 وعالم، وهو الإطار الذي قال RxAndroid، كيف ن · KotterKnife الحكيم استخدام أداة من Kotlin، مثل أنكو ن ن الروبوت Kotlin مخصصة مكتبة ■ المتحدثون من أجل\n · Kotlin الحائز على ثلاث سنوات ونصف ~ ن · Kotlin المبشر (التي نصبت نفسها) ن · اليابان Kotlin المستخدم ممثل مجموعة ن · رقم قياسي محاضرة (JJUG CCC وDroidKaigi الخ الخ) ن · الكتابة الأداء: برنامج نيكي 読 切، سلسلة SoftwareDesign، doujinshi، الخ",
    "speaker": {
      "id": 33,
      "name": "Taro Nagasawa",
      "image_url": "https://pbs.twimg.com/profile_images/680403940345790464/6-lApHa9.png",
      "twitter_name": "ngsw_taro",
      "github_name": "ntaro"
    },
    "stime": "2016-02-19 14:00:00",
    "etime": "2016-02-19 14:50:00",
    "category": {
      "id": 6,
      "name": "البيئة وأدوات التطوير"
    },
    "place": {
      "id": 3,
      "name": "غرفة B"
    },
    "language_id": "ja",
    "slide_url": ""
  },
  {
    "id": 34,
    "title": "17 دولة من نصائح متعددة اللغات",
    "description": "نحن جعل أحد التطبيقات التي 17 لغة مختلفة ليكون Taptrip. يجب الضغط N والنقطة التي متعدد اللغات، فإننا سوف نتحدث عن تطوير حقل التدفق. يتحدث عن ن ن متعدد اللغات، والمراسلات من strings.xml وRTL كما هو معروف نسبيا، وهناك الكثير من الواقع الموافق عندما يتعلق الأمر نقطة أخرى أيضا يجب أن نكون حذرين.\n على سبيل المثال، إذا كنت تتوافق مع روسيا، ومنذ مدة من الحرف هو مثل أكثر من ضعف من اليابانيين في التخطيط يجب ياوا الرعاية.\n أيضا إذا كنت تريد الاستعانة بمصادر خارجية لتطبيق الترجمة، كيف وتكلفة الطلب، يجب عليك أن تنظر أيضا في تدفق التنمية، مثل الوقت حتى يتم ترجمته.\n ن من خلال تعريض استكشاف جاء نتائج استطلاع حتى الآن، فإننا نعتقد أن يكون جميلا لو أن يعين في متعدد اللغات هو مستقبلك.\n\n\n [موضوع] ن متعدد اللغات الذين يريدون ن ن [محتويات مشروع] ن · strings.xml (إدارة الأسلوب، وصيغة الجمع المقابلة) ن · دعم RTL (أو ينبغي القيام به كيف بما في ذلك كذلك أولويات التنمية) تدفق نقطة ن · تصميم طلب الترجمة يجب أن احترس من كل ن · اللغة",
    "speaker": {
      "id": 21,
      "name": "konifar",
      "image_url": "https://pbs.twimg.com/profile_images/619379391588511744/V4RrXbvM.jpg",
      "twitter_name": "konifar",
      "github_name": "konifar"
    },
    "stime": "2016-02-19 14:00:00",
    "etime": "2016-02-19 14:50:00",
    "category": {
      "id": 7,
      "name": "صيانة"
    },
    "place": {
      "id": 4,
      "name": "غرفة C"
    },
    "language_id": "",
    "slide_url": ""
  },
  {
    "id": 35,
    "title": "تعريب الخوف والتدويل عبر الأمم",
    "description": "يتعرضون للترهيب الكثير من الناس عن طريق التعريب (L10N) والتدويل (I18N)، ولكن لم يكن لديهم ليكون بين الروبوت يوفر العديد من الأدوات من خارج منطقة الجزاء لمساعد لك في الهيمنة على العالم. تعلم ما لمشاهدة لحين الترميز التطبيق الخاص بك من شأنها أن تجعل حياتك أسهل مرة واحدة تتلقى محتوى محلي. نحن سوف تغطي الموارد البديلة، ملفات الجمل، وتاريخ ورقم منسقات والعملة وغيرها من النصائح من الروبوت ستوديو، وجوجل، والأطراف الثالثة التي سوف يحولك إلى بطل I18N وL10N.",
    "speaker": {
      "id": 34,
      "name": "Siena Aguayo",
      "image_url": "https://pbs.twimg.com/profile_images/673756215021727744/GhVWfsAQ.jpg",
      "twitter_name": "sienatime",
      "github_name": "sienaigg"
    },
    "stime": "2016-02-19 14:00:00",
    "etime": "2016-02-19 14:50:00",
    "category": {
      "id": 7,
      "name": "صيانة"
    },
    "place": {
      "id": 5,
      "name": "غرفة D"
    },
    "language_id": "en",
    "slide_url": ""
  },
  {
    "id": 36,
    "title": "دعونا نجعل الترميز الحية · مكتبة الروبوت",
    "description": "لقد تطور [موضوع]\nAndroid، الناس لديهم أبدا مكتبة مصنوع، كما حدث الناس ن ن [ملخص] ن عادة، تطوير الروبوت، والتي أعتقد في محاولة لإنشاء مكتبة المستقبل أيضا، أعتقد أنه ليس دائما العديد من الذين لديهم خبرة التي تم إنشاؤها مكتبة. بينما يصف كيفية إنشاء مكتبة في هذه الدورة، التي أنشئت فعلا في السابق كنت المكتبة، لتسجيل مكتبة للمخضرم الوسطى مستودع، في حين شرح بكثير من استخدامه، والمضي قدما في حين تتحرك في الواقع من ناحية تذهب.\n ن وبالإضافة إلى ذلك، لخلق بسيط سان ما قبل التطبيق، الموضحة في شكل من الجمهور وقطع من التطبيق إلى المكتبة.\n هذا، من التطبيق لطيف التي بذلت عادة إنشاء، قطع جزء التي يمكن أن تستخرج، من خلال مكتبة، وآمل أن يتم زيادة مكتبة رائعة لأكثر من الآن.\n ن [محتويات إعلان] ن التالية الترميز الحية وستجري وصفه.\n\n- تطبيق نموذج بسيط لإنشاء تخفيضات عينة التطبيق النوعين n خارج المكتبة من\n- اختبار خلق\n- إنشاء مكتبة للمخضرم الوسطى مستودع استخدام المكتبة من تسجيل\n- آخر التطبيق ن ن ※ فقط في حال وقوع اضطرابات خلال الترميز الحية، والانزلاق إلى إدخال تدفق في اتجاه واحد هو ترك إنشاؤها، وأنا أستعد لتكون هناك مشكلة عندما كان في ورطة من المتاعب شبكة · الكمبيوتر.",
    "speaker": {
      "id": 35,
      "name": "Masataka Kono(@mapyo)",
      "image_url": "https://pbs.twimg.com/profile_images/1354553482/4507067_141002367.JPG",
      "twitter_name": "mapyo",
      "github_name": "mapyo"
    },
    "stime": "2016-02-19 15:10:00",
    "etime": "2016-02-19 15:40:00",
    "category": {
      "id": 7,
      "name": "صيانة"
    },
    "place": {
      "id": 2,
      "name": "القاعة A"
    },
    "language_id": "ja",
    "slide_url": ""
  },
  {
    "id": 37,
    "title": "دراسات حالة Kotlin إلى Android المنتج الحقيقي",
    "description": "• اللغة Kotlin في تطوير نظرة عامة\nAndroid أعتقد أن جاء درجة من الاهتمام هي جدا، ولكن اعتقد انها ليست الكثير من لا يزال تتبع استخدمت سجل في المنتج الفعلي. لذلك، استنادا إلى سجل حافل تطوير الروبوت الإصدار من التطبيق ثمانية النامية في Sansan، شركة، عملية إدخال Kotlin لمشروع جافا القائمة على ن\n- من وجهة نظر من مقدمة المنتج الحقيقي لKotlin\n- أشياء مثل الجدارة ن ن بعد مقدمة N- أن كان وقتا عصيبا عندما نوصي نقطة مريحة مشروع N- نقطة\n- Kotlin يجب ارتداء سجلا واستخدام الغاز للتعايش مكتبة النوعين n من قانون جافا لأني أود أن أتحدث.\n ن · الموضوع ن بالفعل أولئك الذين هم أولئك أو شخص مهتم\nKotlin ما قيل أنها تفكر في إدخال سجل مسار التنمية هناك Kotlin من تطبيقات الروبوت في جاوة",
    "speaker": {
      "id": 36,
      "name": "Jumpei Yamamoto",
      "image_url": "https://avatars3.githubusercontent.com/u/1436634?v=3&s=400.jpg",
      "twitter_name": "",
      "github_name": "yamamotoj"
    },
    "stime": "2016-02-19 15:10:00",
    "etime": "2016-02-19 15:40:00",
    "category": {
      "id": 6,
      "name": "البيئة وأدوات التطوير"
    },
    "place": {
      "id": 3,
      "name": "غرفة B"
    },
    "language_id": "ja",
    "slide_url": ""
  },
  {
    "id": 38,
    "title": "ما هو الفرق بين جافا سكريبت وجافا؟",
    "description": "## الموضوعات ن * بنية التطبيق إطار الروبوت في تطوير تعاني من العمل تقدما ن * تم نقل الفنيين بيئة ويب الواجهة الأمامية لالروبوت من ن ن ## نظرة عامة\nJavaScript وعلى بينة من الاختلافات في جاوة في حين، سوف يتحدث لجلب العمارة والثقافة التي تحظى بشعبية كبيرة في واجهة ويب الأمامية جافا سكريبت لالروبوت.\n\n و 'الواجهة الأمامية جافا سكريبت '' الروبوت جافا'، هذه الأهداف التي أنا تماما وكأنه شيء مختلف، 'الحكم على التفاعل من المستخدم' شائعة. إذا من متجر أندرويد هو 'الواجهة الأمامية الويب هي الغالبة الآن هو تيكو قزم ... فاسدة في العام المقبل'، وكثير من الأحيان، ولكنه يعني أيضا أنه في الكثير من السرعة وعلى العكس التكنولوجيا والبيئة تطورت.\n\nAndroid أيضا ربط البيانات كان بداية لتقديمها للمسؤول. هذه هي التكنولوجيا التي استخدمت على نطاق واسع حتى ويب، ولكن تأسست أخيرا إلى الروبوت.\n وبهذه الطريقة، بينما واعية من الفرق عن بعضها البعض، من خلال دمج الموضة الأمامية جافا سكريبت لتستمر في التطور في سرعة تفجرها، والقصة التي أعتقد أن لدينا شيئا اكتشاف جديد.\n ن وبالإضافة إلى ذلك، كما المعرفة التي تم الحصول عليها من تنفيذ مكتبة تسمى جلب في Droidux ومسترجع للبيئة أندرويد، لم يكن لديك إلى الذهن عندما لدمج المكتبة مثل جافا سكريبت، مثل بيئة مختلفة للجافا الروبوت، ويأتي من الفرق بين اللغة كما أعتقد أن أتمكن من مناقشة الاختلافات بين مثل هذه السياسة التنفيذ.\n\n (※ لأن مجرد الروبوت الرئيسي لا تذهب فقط إلى السهل إلى تفعيل جافا سكريبت) و ن ن ## المحتوى ن ### للأزياء في الواجهة الأمامية ن * جافا سكريبت ليتكلم العمارة ن * الروبوت جافا الفرق للشبكة الأمامية جافا سكريبت ن * الجريان، مسترجع: الهندسة المعمارية تطبيق جافا سكريبت ن * الجريان، مسترجع لالروبوت ن * عوائد `rx.Observable <T>` مكتبة ن * `rx.Observable <T>` التوحيد رمز جيل ن * ربط البيانات ن * RxJava ن ن ### لا أتكلم ن * الويب غرامة قصة ن * جافا سكريبت مكتبة التفاصيل ن * جافا سكريبت واجهة النظام المكون وفقا لنظرية ن * معالجة الشرح مكتبة (رد فعل تقى) ن * مكتبة الروبوت واجهة المستخدم",
    "speaker": {
      "id": 37,
      "name": "Masayuki IZUMI (@izumin5210)",
      "image_url": "https://pbs.twimg.com/profile_images/414065206210220032/bJezBEvM.jpeg",
      "twitter_name": "izumin5210",
      "github_name": "izumin5210"
    },
    "stime": "2016-02-19 15:10:00",
    "etime": "2016-02-19 15:40:00",
    "category": {
      "id": 8,
      "name": "أحدث التطورات في الروبوت"
    },
    "place": {
      "id": 4,
      "name": "غرفة C"
    },
    "language_id": "ja",
    "slide_url": ""
  },
  {
    "id": 39,
    "title": "الروبوت، Brillo، والكروم OS",
    "description": "[ملخص] المشرف تطوير الروبوت من أندي روبين لساندر Pichai إلى ن تغيرت 2013 سنة.\n ثم، فقد كان غالبا ما التبليغ عن إدماج الروبوت ونظام تشغيل Chrome.\n لديك وظيفة الفعلي من نظام تشغيل Chrome التي تم اتخاذها لالروبوت، وأيضا 11 فجأة تقنيات عمليات التنمية في مصدر نشرت في نظام التشغيل مايو، أصبح Brillo ما يمكن أن يقال أن الروبوت ونظام تشغيل Chrome من الهجين.\n\nAndroid، نظام تشغيل Chrome (كروميوم أو إس)، لمقارنة وظيفة Brillo، أريد أن أتحدث عن عجب وسيتم دمج وكيف وظيفة من نظام تشغيل Chrome لالروبوت في المستقبل في القائمة على الوهم.\n ن [أعلنت عن خطط المحتويات وظيفة ن · Brillo من نظام تشغيل Chrome التي اتخذت في ن · الروبوت آلية ن · الروبوت، نظام تشغيل Chrome، مقارنة ن ن [موضوع] من التكوين من Brillo ن · الروبوت وأنا كيف أصبح أنا دمج نظام تشغيل Chrome، وإذا كنت مهتما.",
    "speaker": {
      "id": 38,
      "name": "l_b__",
      "image_url": "https://pbs.twimg.com/profile_images/481176364/Google_Prof_Holmes2.jpg",
      "twitter_name": "l_b__",
      "github_name": ""
    },
    "stime": "2016-02-19 15:10:00",
    "etime": "2016-02-19 15:40:00",
    "category": {
      "id": 5,
      "name": "منصة"
    },
    "place": {
      "id": 5,
      "name": "غرفة D"
    },
    "language_id": "ja",
    "slide_url": ""
  },
  {
    "id": 40,
    "title": "CI الروبوت: 2016 طبعة",
    "description": "الجمهور المستهدف: الاختبار هو مهتم بتطوير المتوسطة ن ن نظرة عامة\nAndroid:\nAndroid ليس فقط نظام التشغيل، وأيضا الوضع في كل عام، وتغير لاختبار التطبيق الروبوت.\n منذ عقد من الزمان في معرض حديثه عن اختبار التطبيق الذي قمت بإنشائه، وتثبيت اخراج المعدات الفعلية، كان يشير إلى العملية. بدلا من ذلك، حاول InstrumentationTestCase، uiautomator والأدوات الآلية مثل Robotium، قد حاول كتابة سيناريو اختبار. في ن ومع ذلك، فإن الطريقة التي والتطبيق نفسه معقد وعلى نطاق واسع، وسيكون بعد ذلك من الصعب أن تتوافق مع الحالة التي هو مطلوب تنمية عالية السرعة. هذه الصعوبة هو واضح هو الحفاظ على كود الاختبار، وسوف يخرج على أساس منتظم لا تعمل على تنفيذ الاختبار ورمز اختبار، وجاء تعقيد صيانة للتدخل في اختراق الاختبار.\n اختبار للحفاظ دائما حتى الآن للدولة، وحتى أكثر من التنمية الثقافية للفريق التطوير، هو آلية أساسية التي تنبعث من تحذير عند وقوع تناقض بين أحدث التطبيقات والاختبار. على الرغم من أن ما يشار إليه هذه الآلية لمثل CI (التكامل المستمر)، حتى الآن الروبوت من مختلف القيود التقنية المنسب يصبح عنق الزجاجة، وإعدادات معقدة وتحقيق CI العام، من أول اختبار · CI وطلب تصميم الترقب.\n نسخة صعودا والوضع Gradle الروبوت المساعد، كان يتغير من تطور أنواع مختلفة من أدوات الاختبار. بدأت أيضا مع أحد التطبيقات الموجودة، فإن البيئة التي يمكن أن تبدأ من اختبار على نطاق صغير مجهزة تجهيزا جيدا. من أجل\n اختبار ذلك الروبوت، وبعد التمرين وسيلة سهلة لفهم وتصنيف الصورة الشاملة وكلمة ذات الصلة في طبقة، وسيلة لتحقيق تصميم الاختبار وأحدث CI في كل طبقة، يفسر رش مع الأمثلة.",
    "speaker": {
      "id": 39,
      "name": "Yusuke Yagyu",
      "image_url": "https://avatars2.githubusercontent.com/u/1888328?v=3&s=400.jpg",
      "twitter_name": "",
      "github_name": "gyugyu"
    },
    "stime": "2016-02-19 15:50:00",
    "etime": "2016-02-19 16:20:00",
    "category": {
      "id": 7,
      "name": "صيانة"
    },
    "place": {
      "id": 2,
      "name": "القاعة A"
    },
    "language_id": "ja",
    "slide_url": ""
  },
  {
    "id": 41,
    "title": "تعلمت من عامين تصبح المهندسين الروبوت",
    "description": "الموضوع:\n- الآن الناس ن ن محة عامة عن مجرد بداية للشعب\n- تطوير التطبيق الروبوت كنت تريد أن تبدأ في تطوير تطبيقات الروبوت: في العام الثاني كما الروبوت مهندس تنتهي بحلول الوقت\nDroidKaigi 2016 سيقام . عندما نتعلم تقنية تطوير التطبيق الروبوت من\n0، وكيفية التعلم وذهب وكان يجب القيام به، أريد أن أشارك وما كان أي فشل ن.\n ن وبالإضافة إلى ذلك، وإلى تنفيذ التنمية من خلال شخص واحد، أريد أن أشارك أيضا اختلافات ويلاحظ في حالة أداء فريق التطوير.\n ليس مهندس الروبوت لا يزال ناضجة، إذا نظرنا إلى الوراء للتو، ن قد تساعد في المستقبل من خطوة واحدة، المكان كان جيدا، وأعتقد أنه إذا يمكن أن أقول لكم ن الجميع المكان كان سيئا.",
    "speaker": {
      "id": 40,
      "name": "Ryutaro Miyashita",
      "image_url": "https://pbs.twimg.com/profile_images/625336726655897600/3XGY2KW0.jpg",
      "twitter_name": "ryugoo_",
      "github_name": "ryugoo"
    },
    "stime": "2016-02-19 15:50:00",
    "etime": "2016-02-19 16:20:00",
    "category": {
      "id": 2,
      "name": "آخر"
    },
    "place": {
      "id": 3,
      "name": "غرفة B"
    },
    "language_id": "ja",
    "slide_url": ""
  },
  {
    "id": 42,
    "title": "بناء عهدك آر إكس ملاحظتها / الاشتراك",
    "description": "1. على الرغم من نظرة عامة ن يسير انتشار RxJava وRxAndroid في العام الماضي، مقارنة باستخدام عقبات يمكن ملاحظتها أو المشغل التي يتم توفيرها، إلى ارتفاع لا يزال لخلق نفسك في ملاحظتها ومشغل، والمشترك. وبالإضافة إلى ذلك، في المقام الأول، وكيف يمكن أن تمثل وظيفة كنت ترغب في توفير بأنفسهم كيف في RxJava، فمن الضروري النظر أيضا. على سبيل المثال، لعرض الحوار في منتصف العملية، إذا كنت تريد أن تتحول إلى المعالجة من قبل التحديد، كيف يمكن أنا؟ بعد تنفيذ عملية الانتقال من النشاط بحيث شاشة تسجيل الدخول؟ أنها ليست مخصصة للملاحظة والمشترك إلغاء الاشتراك قد تكون كيفية التعامل؟\n ن في هذا الحديث، كمثال مؤلف API القريبة خلق مكتبة RxJava RxNearby (https://github.com/hkurokawa/RxNearby)، وكيف تريد ما أسقطت عملية لRxJava القيام به، يمكن ملاحظتها مخصصة يا يجب أن تكون على علم ما يجب عند إنشاء مشترك مخصص لشرح. على وجه الخصوص، 1) أن مركز RxJava هو المشترك، 2) عند ملاحظتها هي الاشتراك، وعندما يتم مراقبة، على التوالي، مما يجعل ما مكتبة تجهيز النظام سوف تفهم كيف ينقل المهم في ما سبق، فإننا نعتقد أن المحتوى الذي يتضمنها.\n\n2 مع مراعاة تجربة N- RxJava نفهم مفهوم N- آر إكس، والناس\n\n3 كنت مهتما في التفاصيل. جدول المحتويات اقترح أوجز API القريبة N- وكيف في RxJava صفقة من الأفكار\n- RxNearby كيفية استخدام\n- يمكن ملاحظتها ووصف المشغل\n- MessageSubscribeOnSubscribe يتضح من المشترك ووصف الملاحظات\n- MessagePublishOperator إيضاحات",
    "speaker": {
      "id": 41,
      "name": "hydrakecat",
      "image_url": "https://pbs.twimg.com/profile_images/86722804/cat.jpg",
      "twitter_name": "hydrakecat",
      "github_name": "hkurokawa"
    },
    "stime": "2016-02-19 15:50:00",
    "etime": "2016-02-19 16:20:00",
    "category": {
      "id": 8,
      "name": "أحدث التطورات في الروبوت"
    },
    "place": {
      "id": 5,
      "name": "غرفة D"
    },
    "language_id": "ja",
    "slide_url": ""
  },
  {
    "id": 43,
    "title": "5 سنوات تليها 'مرجعية HATENA' لمواصلة تطوير التكنولوجيا التطبيق",
    "description": "5 سنوات تليها 'مرجعية HATENA' لمواصلة تطوير التكنولوجيا التطبيقالجمهور المستهدف: كل من مطوري التطبيق الروبوت وتكنولوجيا لمواصلة طويلة في تطوير وتشغيل وتشارك بشكل خاص في تطوير أكثر من شخص واحد من تطبيقات الروبوت التي تم إجراؤها قبل أكثر من شخص في العام ن\nAndroid التطبيق يا ، من أجل حل المشكلة لتلبية استمر في التنمية الطويلة، وتتحدث إلى مثال تطوير النسخة الأولى صدر 'مرجعية HATENA' التطبيق الروبوت في فبراير 2011.\n ن أولا، CI الذي لا غنى عنه لاستمرار التنمية والإفراج عنهم، يصف الآلي بناء واختبار التلقائي على جينكينز التي اعتمدت في المنزل، لتعاون الآلية وفريق جيثب المؤسسة في إطلاق سراح . بدلا من مجرد لشرح هذه التقنية، بحيث يمكنك التحدث مع التركيز على استخدام نظام بناء Gradle، وسوف يكون من المفيد أيضا في هذا المجال التي لم تعتمد جنكينز وجيثب المؤسسة.\n ن وبالإضافة إلى ذلك، سوف نقدم الأفكار حول التعاون بين المطورين داخل الفريق. على سبيل المثال، لتحديد إصدار المعاينة من نكهة إنتاج نظام بناء، بينما تقدم في نفس الوقت على تحسينات ميزة الصغيرة والسمات الرئيسية المضافة إعادة الهيكلية داخل الفريق، لبراعة على الترميز للحد من وقوع صراع بين السلطتين، وإعادة بيع ديون تتحدث عن الأفكار حول تدفق التنمية، مثل فصل واضح على طلب مراجعة تعليمات برمجية إضافية من وظيفة. يخرج حتى التحدث، ولكن لا تقتصر على تطوير التطبيق الروبوت، ولكنها سوف تكون كثيرة لوإعادة بيع ديون، وما إلى ذلك فعلت تطوير التطبيق طويلة، هو أيضا مهم مثل هذه القصة. لن ن وأخيرا، وإدخال وحدة وكان يطبق في الواقع تصميم لتسهيل التغيير من إضافة أو سلوك الدالة، مثل كيفية الانتقال تدريجيا محل API التي أصبحت المكتبة القديمة ومستنكر، البالغ من العمر وعندما لإعادة كتابة التعليمات البرمجية، وسوف نقدم تقنية التي تمارس فعلا في الكتابة وسيتم استخدام كود طويلة.",
    "speaker": {
      "id": 42,
      "name": "Yuya Nobuoka (@nobuoka)",
      "image_url": "https://pbs.twimg.com/profile_images/692368341894193152/jEFTbQWK.jpg",
      "twitter_name": "nobuoka",
      "github_name": "nobuoka"
    },
    "stime": "2016-02-19 16:30:00",
    "etime": "2016-02-19 17:00:00",
    "category": {
      "id": 7,
      "name": "صيانة"
    },
    "place": {
      "id": 2,
      "name": "القاعة A"
    },
    "language_id": "ja",
    "slide_url": ""
  },
  {
    "id": 44,
    "title": "لكي لا تكون في 'إعلام قبالة'. للإبلاغ الأمثل للتطبيقات الوطنية",
    "description": "[نظرة عامة] وقال التطبيقات التي يمكن أن يتم تسليم إبلاغ مباشرة على الإعلام الجهاز ن لمعدلات أعلى مفتوحة من مجلة البريد الإلكتروني، هي ميزة قوية جدا حتى عند إجراء الاحتفاظ للن المستخدمين غير نشط.\n ومع ذلك، اعتمادا على محتويات الإخطار المفرط أو إخطار أو متوقف إخطار التطبيق، فإنه سوف يكون أيضا السبب الذي يمكن أن يكون لحذف ن أسوأ التطبيق القضية. مناقشة إخطار الأمثل يعني من التطبيق الأصلي في ن ن هذا الإعلان، وكان في الواقع الفعلي من أجل زيادة إخطار جهود معدلات مفتوحة، ن وأود أن نتحدث عن كيفية تنفيذ ذلك.\n ن [موضوع] الذين يقومون بتشغيل التطبيق في ن · مبتدئين تطوير الروبوت إلى وسيط المستخدم ن · الأعمال ن ن [الكلمة] ن · GCM ن · Notidfication ن · ملابس ن محلي إخطار ن · إخطار المنبثقة",
    "speaker": {
      "id": 43,
      "name": "cooky_ch",
      "image_url": "https://avatars0.githubusercontent.com/u/3312886?v=3&s=400.jpg",
      "twitter_name": "",
      "github_name": "cookych"
    },
    "stime": "2016-02-19 16:30:00",
    "etime": "2016-02-19 17:00:00",
    "category": {
      "id": 2,
      "name": "آخر"
    },
    "place": {
      "id": 3,
      "name": "غرفة B"
    },
    "language_id": "ja",
    "slide_url": ""
  },
  {
    "id": 45,
    "title": "الماضي والحاضر والمستقبل من Chrome و Android",
    "description": "لمحة عامة:\nChrome وAndorid لديها نسخة أصبحت تقارب المتبادل عالية لكل لتصبح الجديد لبعضها البعض.\n الويب إذا كنت ترغب بجعل كل من المحتوى والتطبيق الروبوت، لأن كروم لالروبوت (كروم لالروبوت) قد لعبت دورا هاما جدا في ربط الويب والتطبيقات.\n المستقبل وعلاوة على ذلك، فإن العلاقة بين كروم وأندرويد أعتقد أن سوف تصبح مهمة. سوف ن ن هذه الجلسة الحديث عن تطوير التطبيقات الروبوت باستخدام الكروم.\n محة عامة عن مقدمة إلى Chrome لالروبوت، ونحن نتحدث عنها، مثل التغيرات عرض ويب في الروبوت.\n ثم بين التكنولوجيا كروم، فإننا نتحدث عن مثل على وجه الخصوص التي يمكن أن تستخدم لوظيفة تطبيق الروبوت. من أجل\n وأخيرا، فإن مستقبل كروم وأندرويد، وسوف نتحدث عن اهتمام الحركة التفكير.\n ن محتويات مشروع: ن * كروم لالروبوت من نوع ن * تغيير عرض ويب ن * كروم مخصص من علامات التبويب ن * تطبيق ويب المانيفستو ن * عمال الخدمة ودفع الإخطارات ن * التطبيق تيار ※ 1 ن * لتطبيقات الويب التقدمية ن * مستقبل Chrome و Android (الذاتية الفردية) ن ن ن الجمهور المستهدف: وبين الشركة أو الشخص * كروم ن كنت تقوم بتشغيل كل من ن * محتوى الويب والروبوت التطبيق الناس يشعرون أن كنت ترغب في استخدام الناس أو كنت تستخدم عرض ويب في الروبوت من تقارب تريد فعال للاستفادة من الناس ن * التطبيق ن ن ※ 1 المرجع: HTTP: //insidesearch.blogspot.ca/2015/ 11 / جديدة طرق لايجاد وتيار التطبيق-content.html",
    "speaker": {
      "id": 11,
      "name": "Shinobu Okano(@operandoOS)",
      "image_url": "https://pbs.twimg.com/profile_images/2769959234/6e50270293d9b3196223e64c467f3e53.jpeg",
      "twitter_name": "operandoOS",
      "github_name": "operando"
    },
    "stime": "2016-02-19 16:30:00",
    "etime": "2016-02-19 17:00:00",
    "category": {
      "id": 2,
      "name": "آخر"
    },
    "place": {
      "id": 5,
      "name": "غرفة D"
    },
    "language_id": "ja",
    "slide_url": ""
  }
]
